<a href="https://colab.research.google.com/github/riteshk2311/machinelearning/blob/master/Python_Concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Python CONCAT

In [ ]:
import pandas as pd
indian_weather=pd.DataFrame({
    "City":["Bhopal","Delhi","Kota"],
    "Temp":[32,28,37],  
    "Humidity":[60,54,45]                            
       })
us_weather=pd.DataFrame({
    "City":["NY","Chicago","Orlando"],
    "Temp":[38,38,31],  
    "Humidity":[40,76,65]                            
       })

In [ ]:
indian_weather

     City  Temp  Humidity
0  Bhopal    32        60
1   Delhi    28        54
2    Kota    37        45

In [ ]:
us_weather

      City  Temp  Humidity
0       NY    38        40
1  Chicago    38        76
2  Orlando    31        65

In [ ]:
df=pd.concat([indian_weather,us_weather])

In [ ]:
df #AS A INDEX FACES A PROBLEM

      City  Temp  Humidity
0   Bhopal    32        60
1    Delhi    28        54
2     Kota    37        45
0       NY    38        40
1  Chicago    38        76
2  Orlando    31        65

In [ ]:
df=pd.concat([indian_weather,us_weather],ignore_index=True)

In [ ]:
df

      City  Temp  Humidity
0   Bhopal    32        60
1    Delhi    28        54
2     Kota    37        45
3       NY    38        40
4  Chicago    38        76
5  Orlando    31        65

In [ ]:
df=pd.concat([indian_weather,us_weather],keys=["INDIA","US"])

In [ ]:
df

            City  Temp  Humidity
INDIA 0   Bhopal    32        60
      1    Delhi    28        54
      2     Kota    37        45
US    0       NY    38        40
      1  Chicago    38        76
      2  Orlando    31        65

In [ ]:
df.loc["INDIA"]

     City  Temp  Humidity
0  Bhopal    32        60
1   Delhi    28        54
2    Kota    37        45

In [ ]:
pakistan_weather=pd.DataFrame({
    "City":["Lahore","Karanchi","Istanbul"],
    "Temp":[44,45,48],  
    "Humidity":[60,54,45],
    "Wind_Speed":[80,90,100]})

In [ ]:
pakistan_weather

       City  Temp  Humidity  Wind_Speed
0    Lahore    44        60          80
1  Karanchi    45        54          90
2  Istanbul    48        45         100

In [ ]:
df=pd.concat([indian_weather,us_weather,pakistan_weather],ignore_index=True,keys=["INDIA","US","PAK"])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [ ]:
df

       City  Humidity  Temp  Wind_Speed
0    Bhopal        60    32         NaN
1     Delhi        54    28         NaN
2      Kota        45    37         NaN
3        NY        40    38         NaN
4   Chicago        76    38         NaN
5   Orlando        65    31         NaN
6    Lahore        60    44        80.0
7  Karanchi        54    45        90.0
8  Istanbul        45    48       100.0